cask_args appdir: '/Applications'

# Taps
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"
tap "caskroom/cask"

# Binaries
brew 'go'
brew 'fzf'
brew 'fpp'
brew 'jq'
brew 'openssl'
brew 'tmux'
brew 'hub'
brew 'base64'
brew "dnsmasq", restart_service: true
brew "git"
brew "mysql"
brew "bat"

# Hasicorp
brew 'terraform'
brew 'vault'
brew 'consul'
brew 'nomad'

# Apps
cask "caffeine"
cask "firefox"
cask "google-chrome"
cask "sequel-pro"
cask "slack"
cask "spotify"
cask "the-unarchiver"
cask "virtualbox"
cask 'docker'
cask '1password'
cask 'gimp'
cask 'iterm2'
cask 'visual-studio-code'
cask 'pycharm-ce'
cask 'intellij-idea'
cask 'keybase'
cask "vlc"

